# inline_сallback_buttons/lexicon/lexicon_ru.py

# Словарь LEXICON_RU содержит лексикон на русском языке для текстовых элементов проекта
LEXICON_RU: dict[str, str] = {
    # Текст для команды /start
    "/start": "Это инлайн-кнопки с параметром 'Callback'. Нажми на любую!",  # Текст для команды /start
    # Текст для первой кнопки
    "name_button_1": "Большая callback кнопка №1",
    # Текст для второй кнопки
    "name_button_2": "Большая callback кнопка №2",
    # Текст для сообщения после нажатия первой кнопки
    "text_button_1": "Была нажата БОЛЬШАЯ КНОПКА 1",
    # Текст для сообщения после нажатия второй кнопки
    "text_button_2": "Была нажата БОЛЬШАЯ КНОПКА 2",
    # Текст ответа после нажатия первой кнопки
    "text_answer_1": "Ура! Нажата кнопка 1 и уведомление пропадет автоматически.",
    # Текст ответа после нажатия второй кнопки
    "text_answer_2": "Ура! Нажата кнопка 2 и уведомление не пропадет пока не будет нажата кнопка OK."
}
