# own_keyboard_generator/lexicon/lexicon_ru.py

# Словарь LEXICON_RU содержит лексикон на русском языке для текстовых элементов проекта
LEXICON: dict[str, str] = {
    'but_1': 'Кнопка 1',
    'but_2': 'Кнопка 2',
    'but_3': 'Кнопка 3',
    'but_4': 'Кнопка 4',
    'but_5': 'Кнопка 5',
    'but_6': 'Кнопка 6',
    'but_7': 'Кнопка 7', }

# Словарь BUTTONS содержит метки и соответствующие текстовые значения для кнопок, используемых в проекте.
# Ключи словаря представляют собой метки кнопок, а значения - текстовые значения, которые будут отображаться на кнопках.
BUTTONS: dict[str, str] = {
    'btn_1': '1',
    'btn_2': '2',
    'btn_3': '3',
    'btn_4': '4',
    'btn_5': '5',
    'btn_6': '6',
    'btn_7': '7',
    'btn_8': '8',
    'btn_9': '9',
    'btn_10': '10',
    'btn_11': '11'}
