# backend/sim_app/utils/sim_bank_utils.py

'''
Упрощаем комманды
'''

import hashlib
import socket
from datetime import datetime

import xmltodict

# Константы для подключения
########################################################################################################################
HOST = 'dinstar.dzencode.net'
PORT = 3030
########################################################################################################################

# Данные для авторизации
########################################################################################################################
domain = 'dzencode'
user = 'testAPI'
authPwd = 'sdff3432SDFfsd343!3'


########################################################################################################################

# Создает XML-запрос для отправки на сервер.
########################################################################################################################
def generate_request(cmd: str, additional_params: str = '') -> str:
    """
    Создает XML-запрос для отправки на сервер.

    :param cmd: Команда для выполнения.
    :param additional_params: Дополнительные параметры команды.
    :return: XML-запрос в виде строки.
    """
    # Генерация уникального номера запроса и временной метки
    sn = str(round(datetime.now().timestamp()))
    timestamp = datetime.now().timestamp()

    # Формирование строки для хэширования
    # Эта строка включает в себя уникальные данные запроса и данные для авторизации
    str_to_hash = f"request{sn}{domain}{user}{cmd}{timestamp}{authPwd}"
    authInfo = hashlib.md5(str_to_hash.encode()).hexdigest()

    # Создание XML-запроса
    request = f"""
    <?xml version="1.0" encoding="utf-8"?>
    <simsrv version="1.0" msg_type="request">
    <header>
    <param name="SN" value="{sn}" />
    <param name="Domain" value="{domain}" />
    <param name="User" value="{user}" />
    <param name="Cmd" value="{cmd}" />
    <param name="Retries" value="0" />
    <param name="Timeout" value="5000" />
    <param name="Timestamp" value="{timestamp}" />
    <param name="AuthInfo" value="{authInfo}" />
    </header>
    <{cmd}>
    {additional_params}
    </{cmd}>
    </simsrv>
    """

    # Возвращаем созданный XML-запрос в виде строки
    return request


########################################################################################################################

# Отправляем запрос на сервер и получает ответ.
########################################################################################################################
def send_request(request: str) -> dict:
    """
    Отправляет XML-запрос на сервер и получает ответ.

    :param request: XML-запрос в виде строки.
    :return: Ответ сервера в формате словаря.
    """
    # Создание UDP-сокета
    with socket.socket(socket.AF_INET, socket.SOCK_DGRAM) as s:
        # Отправка запроса на сервер
        s.sendto(request.encode(), (HOST, PORT))
        # Получение ответа от сервера
        response_data = s.recv(81920)
        # Преобразование XML-ответа в словарь
        return XMLtoJson(response_data)


########################################################################################################################

# Преобразует XML-данные в словарь.
########################################################################################################################
def XMLtoJson(data: bytes) -> dict:
    """
    Преобразует XML-данные в словарь.

    :param data: XML-данные в байтах.
    :return: Данные в формате словаря.
    """
    # Преобразование XML в словарь
    return xmltodict.parse(data.decode().strip('\x00'))
########################################################################################################################
